TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L1306/driverlib/empty_driverlib_src/ti/driverlib/dl_mcan.h
/** @addtogroup DL_MCAN_INTR_SRC
 *  @{
 */
/*!
 * @brief Rx FIFO 0 New Message interrupt
 */
#define DL_MCAN_INTR_SRC_RX_FIFO0_NEW_MSG                    (MCAN_IR_RF0N_MASK)

/*!
 * @brief Rx FIFO 0 Watermark Reached interrupt
 */
#define DL_MCAN_INTR_SRC_RX_FIFO0_WATERMARK                  (MCAN_IR_RF0W_MASK)

/*!
 * @brief Rx FIFO 0 Full interrupt
 */
#define DL_MCAN_INTR_SRC_RX_FIFO0_FULL                       (MCAN_IR_RF0F_MASK)

/*!
 * @brief Rx FIFO 0 Message Lost interrupt
 */
#define DL_MCAN_INTR_SRC_RX_FIFO0_MSG_LOST                   (MCAN_IR_RF0L_MASK)

/*!
 * @brief Rx FIFO 1 New Message interrupt
 */
#define DL_MCAN_INTR_SRC_RX_FIFO1_NEW_MSG                    (MCAN_IR_RF1N_MASK)

/*!
 * @brief Rx FIFO 1 Watermark Reached interrupt
 */
#define DL_MCAN_INTR_SRC_RX_FIFO1_WATERMARK                  (MCAN_IR_RF1W_MASK)

/*!
 * @brief Rx FIFO 1 Full interrupt
 */
#define DL_MCAN_INTR_SRC_RX_FIFO1_FULL                       (MCAN_IR_RF1F_MASK)

/*!
 * @brief Rx FIFO 1 Message Lost interrupt
 */
#define DL_MCAN_INTR_SRC_RX_FIFO1_MSG_LOST                   (MCAN_IR_RF1L_MASK)

/*!
 * @brief High Priority Message interrupt
 */
#define DL_MCAN_INTR_SRC_HIGH_PRIO_MSG                        (MCAN_IR_HPM_MASK)

/*!
 * @brief Transmission Completed interrupt
 */
#define DL_MCAN_INTR_SRC_TRANS_COMPLETE                        (MCAN_IR_TC_MASK)

/*!
 * @brief Transmission Cancellation Finished interrupt
 */
#define DL_MCAN_INTR_SRC_TRANS_CANCEL_FINISH                  (MCAN_IR_TCF_MASK)

/*!
 * @brief Tx FIFO Empty interrupt
 */
#define DL_MCAN_INTR_SRC_TX_FIFO_EMPTY                        (MCAN_IR_TFE_MASK)

/*!
 * @brief Tx Event FIFO New Entry interrupt
 */
#define DL_MCAN_INTR_SRC_TX_EVT_FIFO_NEW_ENTRY               (MCAN_IR_TEFN_MASK)

/*!
 * @brief Tx Event FIFO Watermark Reached interrupt
 */
#define DL_MCAN_INTR_SRC_TX_EVT_FIFO_WATERMARK               (MCAN_IR_TEFW_MASK)

/*!
 * @brief Tx Event FIFO Full interrupt
 */
#define DL_MCAN_INTR_SRC_TX_EVT_FIFO_FULL                    (MCAN_IR_TEFF_MASK)

/*!
 * @brief Tx Event FIFO Element Lost interrupt
 */
#define DL_MCAN_INTR_SRC_TX_EVT_FIFO_ELEM_LOST               (MCAN_IR_TEFL_MASK)

/*!
 * @brief Timestamp Wraparound interrupt
 */
#define DL_MCAN_INTR_SRC_TIMESTAMP_WRAPAROUND                 (MCAN_IR_TSW_MASK)

/*!
 * @brief Message RAM Access Failure interrupt
 */
#define DL_MCAN_INTR_SRC_MSG_RAM_ACCESS_FAILURE              (MCAN_IR_MRAF_MASK)

/*!
 * @brief Timeout Occurred interrupt
 */
#define DL_MCAN_INTR_SRC_TIMEOUT                              (MCAN_IR_TOO_MASK)

/*!
 * @brief Message stored to Dedicated Rx Buffer interrupt
 */
#define DL_MCAN_INTR_SRC_DEDICATED_RX_BUFF_MSG                (MCAN_IR_DRX_MASK)

/*!
 * @brief Bit Error Uncorrected interrupt
 */
#define DL_MCAN_INTR_SRC_BIT_ERR_UNCORRECTED                  (MCAN_IR_BEU_MASK)

/*!
 * @brief Error Logging Overflow interrupt
 */
#define DL_MCAN_INTR_SRC_ERR_LOG_OVRFLW                       (MCAN_IR_ELO_MASK)

/*!
 * @brief Error Passive interrupt
 */
#define DL_MCAN_INTR_SRC_ERR_PASSIVE                           (MCAN_IR_EP_MASK)

/*!
 * @brief Warning Status interrupt
 */
#define DL_MCAN_INTR_SRC_WARNING_STATUS                        (MCAN_IR_EW_MASK)

/*!
 * @brief Bus_Off Status interrupt
 */
#define DL_MCAN_INTR_SRC_BUS_OFF_STATUS                        (MCAN_IR_BO_MASK)

/*!
 * @brief Watchdog Interrupt interrupt
 */
#define DL_MCAN_INTR_SRC_WATCHDOG                             (MCAN_IR_WDI_MASK)

/*!
 * @brief Protocol Error in Arbitration Phase interrupt
 */
#define DL_MCAN_INTR_SRC_PROTOCOL_ERR_ARB                     (MCAN_IR_PEA_MASK)

/*!
 * @brief Protocol Error in Data Phase interrupt
 */
#define DL_MCAN_INTR_SRC_PROTOCOL_ERR_DATA                    (MCAN_IR_PED_MASK)

/*!
 * @brief Access to Reserved Address interrupt
 */
#define DL_MCAN_INTR_SRC_RES_ADDR_ACCESS                      (MCAN_IR_ARA_MASK)

/** @}*/

/* User defined ranges */
/*!
 * @brief Maximum data synch jump width
 */
#define DL_MCAN_DBTP_DSJW_MAX                                             (0xFU)
/*!
 *  @brief Max data time segment 2
 */
#define DL_MCAN_DBTP_DTSEG2_MAX                                           (0xFU)
/*!
 *  @brief Max data time segment 1
 */
#define DL_MCAN_DBTP_DTSEG1_MAX                                          (0x1FU)
/*!
 *  @brief Max data date rate prescalar
 */
#define DL_MCAN_DBTP_DBRP_MAX                                            (0x1FU)
/*!
 *  @brief Max nom synch jump width
 */
#define DL_MCAN_NBTP_NSJW_MAX                                            (0x7FU)
/*!
 *  @brief Max nom synch time segment 2
 */
#define DL_MCAN_NBTP_NTSEG2_MAX                                          (0x7FU)
/*!
 *  @brief Max nom synch time segment 1
 */
#define DL_MCAN_NBTP_NTSEG1_MAX                                          (0xFFU)
/*!
 *  @brief Max nom data date rate prescalar
 */
#define DL_MCAN_NBTP_NBRP_MAX                                           (0x1FFU)
/*!
 *  @brief Max wdc preload
 */
#define DL_MCAN_RWD_WDC_MAX                                              (0xFFU)
/*!
 *  @brief Transmitter Delay Compensation Filter Window Length
 */
#define DL_MCAN_TDCR_TDCF_MAX                                            (0x7FU)
/*!
 *  @brief Transmitter Delay Compensation Offset
 */
#define DL_MCAN_TDCR_TDCO_MAX                                            (0x7FU)
/*!
 *  @brief Max MCAN extended id mask
 */
#define DL_MCAN_XIDAM_EIDM_MAX                                     (0x1FFFFFFFU)
/*!
 *  @brief Max timestamp counter prescaler
 */
#define DL_MCAN_TSCC_TCP_MAX                                              (0xFU)
/*!
 *  @brief Max timeout preload
 */
#define DL_MCAN_TOCC_TOP_MAX                                           (0xFFFFU)

/* clang-format on */

/**
 *  @brief   Enum to select the MCAN instance
 */
typedef enum {
    /*! Selects CANFD instance 0 of device */
    DL_MCAN_INSTANCE_0 = SYSCTL_SYSSTATUS_MCAN0READY_MASK,
} DL_MCAN_INSTANCE;

/**
 *  @brief   Enum to select source clock for CANCLK
 */
typedef enum {
    /*! Selects SYSPLLCLK1 as the source clock for CANCLK */
    DL_MCAN_FCLK_SYSPLLCLK1 = SYSCTL_GENCLKCFG_CANCLKSRC_SYSPLLOUT1,
    /*! Selects HFCLK as the source clock for CANCLK */
    DL_MCAN_FCLK_HFCLK = SYSCTL_GENCLKCFG_CANCLKSRC_HFCLK,
} DL_MCAN_FCLK;

/**
 *  @brief   Enum to select CANCLK divider
 */
typedef enum {
    /*! Clock divider 1 */
    DL_MCAN_FCLK_DIV_1 = MCAN_CLKDIV_RATIO_DIV_BY_1_,
    /*! Clock divider 2 */
    DL_MCAN_FCLK_DIV_2 = MCAN_CLKDIV_RATIO_DIV_BY_2_,
    /*! Clock divider 4 */
    DL_MCAN_FCLK_DIV_4 = MCAN_CLKDIV_RATIO_DIV_BY_4_,
} DL_MCAN_FCLK_DIV;

/**
 *  @brief   Enum to select the MCAN interrupt lines
 */
typedef enum {
    /*! MCAN interrupt line 0 */
    DL_MCAN_INTR_LINE_NUM_0 = 0U,
    /*! MCAN interrupt line 1 */
    DL_MCAN_INTR_LINE_NUM_1 = 1U

} DL_MCAN_INTR_LINE_NUM;

/**
 *  @brief   Enum to represent the MCAN Identifier Type
 */
typedef enum {

